package 시험답안;

public class 서술형 {
	
	/*  클래스와 객체의 특징 등을 예시를 들어서 설명 할 것 
	 * 
	    1. 클래스 = 필드와 메소드로 이루어지며 객체를 만들기 위한 설계도이다.
	       객체 = 변수와 메소드로 이루어져 있으며, 특성과 행동을 보유하고 있다. 즉, 클래스라는 설계도를 따라 고유데이터, 상태, 부품 등이 결합되어 구체화 된 요소이다. 
	    
	       예를 들어 자동차라는 클래스 즉, 자동차 설계도에 겍체의 고유데이터인 제작회사, 모델, 색깔 최고속도등이 있고 상태로는 현재 속도, 엔진 회전수가 구체화 되며 
	       부품으로는 차체, 엔진, 타이어등이 결합 되어 자동차라는 클래스를 구체화 시키는 것이다.
	
	
	
		2. 오버로딩과 오버라이딩은 무엇이며 차이점은 무엇인지 서술하시오.
		 
		오버로딩 = 부모클래스에서 정의된 메소드를 자식클래스에서 재정의 하는 것	
		
		오버라이딩 =  동일한 클래스의 같은 이름을 가진 메소드를 매개변수와 타입등이 다른 것들을 의미한다.	
		
		두개의 차이점은
		오버로딩은 매게변수나 타입이 달라야하지만 오버라이딩은 동일해야하고 오버로딩은 리턴 타입이 무엇이든지 상관없지만 오버라이딩은 동일해야한다는 차이점이 있다.
			
			
		3. Array배열과 컬렉션의 ArrayList이 무엇이며 차이점은 무엇인지 서술하시오. 
		Array란 동일한 데이터타입의 데이터를 연속된 공간에 저장하기 위한 배열구조이다
		ArrayList는 자바의 List 인터페이스를 상속받은 여러 클래스 중 하나입니다. 일반 배열과 동일하게 연속된 메모리 공간을 사용하며 인덱스는 0부터 시작합니다
		
		1. Array배열은 고정길이이기 대문에 배열을 모두 채우면 새로운 데이터를 추가해야하는 반면에 ArrayList는 가변크기를 가지고있어 삽입과 삭제가 용이하다는 차이점이 있다.
		2. Array 배열는 int, char 등과 object를 가질 수 있지만 ArrayList는 오직 Object만을 가질 수 있다.
		3. 배열은 제네릭을 사용할 수 없지만, arrayList는 타입 안정성을 보장해주는 제네릭을 사용할 수 있다.
		
		
		
		4. ArrayList 코드 예시의 빈칸을 기입하는 것
		 
	 
	 

	 */
	
	
 
}
