package java_Class;

public class Ex_클래스2 {
	
	
	/*
	 
	 객체 변수는 레퍼런스(주소)를 가지고 있다.
	 
	 레퍼런스에 있는 변수를 수정하려면 '레퍼런스 주소. 연산자를' 사용한다
	 
	 
	 ================ 생성자 설명 ===============
	 
	 생성자는 메소드다
	 
	 생성자는 new를 통해 객체를 생셩할때만 호출이 된다.
	 
	 생성자는 리턴이 없어서 void나 double을 쓸 필요가 없다.
	 
	 생성자는 같은 데이터타입을 두번이상 사용할 수 없다.
	 
	 생성자는 데이터타입의 종류를 구분하여 사용할 수 있다.
	 
	 생성자를 사용하는 이유는 새로운 객체 생성을 위해서다
	 
	 
	 ================ 기본 생성자 =============
	 
	 기본생성자 (default constructor)
	 
	 	 매개변수 없고 아무작업 없이 단순 리턴하는 생성자
	 	 
	 	 디폴트 생성자라고도 부른다.
	 	 
	 	 
	 
	 ================ this =================
	 
	 객체 자신에 대한 레퍼런스
	 
	 필요성
	 객체의 멤버 변수와 메소드 변수가 같을 때
	 다른 메소드 호출 시 객체 자신의 레퍼런스를 전달할 때
	 메소드가 객체 자신의 레퍼런스를 반환할 때
	 
	 
	 
	 ================= this () ==============
	 
	 다른 생성자를 호출하는 메소드이다.
	 
	 클래스 내의 다른 생성자 호출
	 
	 생성자 내에서만 사용 가능
	 
	 무조건 코드 첫줄에 있어야함 그렇지 않을 경우 오류가 발생한다.
	 
	 
	 
	 =============== 객체의 치환================
	 
	 
	 
	 
	 =============== 객체 배열===================
	 
	 
	 
	 ================ Object ==================
	 
	 
	 클래스와 객체의 개념
	 
	 메소드 오버로딩, 오버라이딩(재 정의)
	 
	 
	 
	 
	 
	 ==============
	 String title = scanner.nextline.() 중 nextline은 문자열을 입력하기 위한 코드이다.
	 
	 null은 가리키고 있는 레퍼런스(주소)가 없는 것을 뜻한다.
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	 
	   */

}
